<?php

return [
    'enable' => [
        'header' => 'لم تقم بتفعيل التحقق بخطوتين بعد.',
        'description' => 'عند تفعيل التحقق بخطوتين، سيُطلب منك إدخال رمز آمن وعشوائي أثناء تسجيل الدخول. يمكنك الحصول على هذا الرمز من تطبيق Google Authenticator على هاتفك.',
    ],
    'logout' => [
        'button' => 'تسجيل الخروج',
    ],
    'enabled' => [
        'header' => 'لقد قمت بتفعيل التحقق بخطوتين.',
        'description' => 'احفظ هذه الرموز الاحتياطية في مدير كلمات مرور آمن. يمكن استخدامها لاستعادة الوصول إلى حسابك في حال فقدت جهاز التحقق بخطوتين.',
    ],
    'setup_confirmation' => [
        'header' => 'أكمل تفعيل التحقق بخطوتين.',
        'description' => 'عند تفعيل التحقق بخطوتين، سيُطلب منك إدخال رمز آمن وعشوائي أثناء تسجيل الدخول. يمكنك الحصول على هذا الرمز من تطبيق Google Authenticator على هاتفك.',
        'scan_qr_code' => 'لإكمال تفعيل التحقق بخطوتين، امسح رمز QR أدناه باستخدام تطبيق المصادقة على هاتفك أو أدخل مفتاح الإعداد وقدم رمز OTP الناتج.',
    ],
    'base' => [
        'wrong_user' => 'يجب أن يكون كائن المستخدم المصادق نموذج مصادقة Filament للسماح بتحديث صفحة الملف الشخصي.',
        'rate_limit_exceeded' => 'عدد كبير جداً من الطلبات',
        'try_again' => 'يرجى المحاولة مرة أخرى خلال :seconds ثانية',
    ],
    '2fa' => [
        'confirm' => 'تأكيد',
        'cancel' => 'إلغاء',
        'enable' => 'تفعيل',
        'disable' => 'إيقاف التفعيل',
        'confirm_password' => 'تأكيد كلمة المرور',
        'wrong_password' => 'كلمة المرور المدخلة غير صحيحة.',
        'code' => 'الرمز',
        'setup_key' => 'مفتاح الإعداد :setup_key.',
        'current_password' => 'كلمة المرور الحالية',
        'regenerate_recovery_codes' => 'توليد رموز استرداد جديدة',
    ],
    'passkey' => [
        'add' => 'إنشاء مفتاح مرور',
        'name' => 'الاسم',
        'added' => 'تمت إضافة مفتاح المرور بنجاح.',
        'login' => 'تسجيل الدخول باستخدام مفتاح المرور',
    ],
];
