<?php

return [
    'navigation' => [
        'group' => 'المحتوى',
        'label' => 'الصفحات',
        'singular' => 'صفحة',
        'plural' => 'الصفحات',
    ],
    'form' => [
        'slug' => 'العنوان (Slug)',
        'slug_helper' => 'يمكنك كتابة العنوان يدويًا أو توليده تلقائيًا من العنوان الإنجليزي مع مراعاة تحسين محركات البحث (SEO).',
        'generate_slug' => 'توليد العنوان',
        'active' => 'نشطة',
        'translations' => 'الترجمات',
        'locale' => 'اللغة',
        'title' => 'العنوان',
        'content' => 'المحتوى',
        'file' => 'ملف مرفق (اختياري)',
        'meta_description' => 'الوصف التعريفي',
        'keywords' => 'الكلمات المفتاحية',
        'add_translation' => 'إضافة ترجمة',
        'title_unique_error' => 'هذا العنوان موجود لا يمكن حفظه',
        'home_page' => 'الصفحة الرئيسية',
        'journal_helper' => 'اختر المجلة إذا كانت هذه الصفحة تابعة لمجلة، أو اتركها فارغة لتكون الصفحة الرئيسية.',

    ],
    'table' => [
        'slug' => 'الرابط',
        'title' => 'العنوان',
        'active' => 'نشطة',
        'created_at' => 'تاريخ الإنشاء',
    ],
];
